---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoise
source: html/5fbd032e-8662-00aa-5324-7f5551c24417.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoise Property

The property labeled "Noise Type" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoise { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientNoiseType".